grevaillot/svd_tools/headers/STM32H7x7_CM7/hrtim_timc.h
#pragma once 

/* --- HRTIM_TIMC: High Resolution Timer: TIMC ---------------------- */

/** @defgroup hrtim_timc_registers High Resolution Timer: TIMC Register
@{*/

/** HRTIM_TIMC_TIMCCR Timerx Control Register **/
#define HRTIM_TIMC_TIMCCR			MMIO32(HRTIM_TIMC_BASE + 0x00)
/** HRTIM_TIMC_TIMCISR Timerx Interrupt Status Register **/
#define HRTIM_TIMC_TIMCISR			MMIO32(HRTIM_TIMC_BASE + 0x04)
/** HRTIM_TIMC_TIMCICR Timerx Interrupt Clear Register **/
#define HRTIM_TIMC_TIMCICR			MMIO32(HRTIM_TIMC_BASE + 0x08)
/** HRTIM_TIMC_TIMCDIER5 TIMxDIER5 **/
#define HRTIM_TIMC_TIMCDIER5			MMIO32(HRTIM_TIMC_BASE + 0x0c)
/** HRTIM_TIMC_CNTCR Timerx Counter Register **/
#define HRTIM_TIMC_CNTCR			MMIO32(HRTIM_TIMC_BASE + 0x10)
/** HRTIM_TIMC_PERCR Timerx Period Register **/
#define HRTIM_TIMC_PERCR			MMIO32(HRTIM_TIMC_BASE + 0x14)
/** HRTIM_TIMC_REPCR Timerx Repetition Register **/
#define HRTIM_TIMC_REPCR			MMIO32(HRTIM_TIMC_BASE + 0x18)
/** HRTIM_TIMC_CMP1CR Timerx Compare 1 Register **/
#define HRTIM_TIMC_CMP1CR			MMIO32(HRTIM_TIMC_BASE + 0x1c)
/** HRTIM_TIMC_CMP1CCR Timerx Compare 1 Compound Register **/
#define HRTIM_TIMC_CMP1CCR			MMIO32(HRTIM_TIMC_BASE + 0x20)
/** HRTIM_TIMC_CMP2CR Timerx Compare 2 Register **/
#define HRTIM_TIMC_CMP2CR			MMIO32(HRTIM_TIMC_BASE + 0x24)
/** HRTIM_TIMC_CMP3CR Timerx Compare 3 Register **/
#define HRTIM_TIMC_CMP3CR			MMIO32(HRTIM_TIMC_BASE + 0x28)
/** HRTIM_TIMC_CMP4CR Timerx Compare 4 Register **/
#define HRTIM_TIMC_CMP4CR			MMIO32(HRTIM_TIMC_BASE + 0x2c)
/** HRTIM_TIMC_CPT1CR Timerx Capture 1 Register **/
#define HRTIM_TIMC_CPT1CR			MMIO32(HRTIM_TIMC_BASE + 0x30)
/** HRTIM_TIMC_CPT2CR Timerx Capture 2 Register **/
#define HRTIM_TIMC_CPT2CR			MMIO32(HRTIM_TIMC_BASE + 0x34)
/** HRTIM_TIMC_DTCR Timerx Deadtime Register **/
#define HRTIM_TIMC_DTCR			MMIO32(HRTIM_TIMC_BASE + 0x38)
/** HRTIM_TIMC_SETC1R Timerx Output1 Set Register **/
#define HRTIM_TIMC_SETC1R			MMIO32(HRTIM_TIMC_BASE + 0x3c)
/** HRTIM_TIMC_RSTC1R Timerx Output1 Reset Register **/
#define HRTIM_TIMC_RSTC1R			MMIO32(HRTIM_TIMC_BASE + 0x40)
/** HRTIM_TIMC_SETC2R Timerx Output2 Set Register **/
#define HRTIM_TIMC_SETC2R			MMIO32(HRTIM_TIMC_BASE + 0x44)
/** HRTIM_TIMC_RSTC2R Timerx Output2 Reset Register **/
#define HRTIM_TIMC_RSTC2R			MMIO32(HRTIM_TIMC_BASE + 0x48)
/** HRTIM_TIMC_EEFCR1 Timerx External Event Filtering Register 1 **/
#define HRTIM_TIMC_EEFCR1			MMIO32(HRTIM_TIMC_BASE + 0x4c)
/** HRTIM_TIMC_EEFCR2 Timerx External Event Filtering Register 2 **/
#define HRTIM_TIMC_EEFCR2			MMIO32(HRTIM_TIMC_BASE + 0x50)
/** HRTIM_TIMC_RSTCR TimerA Reset Register **/
#define HRTIM_TIMC_RSTCR			MMIO32(HRTIM_TIMC_BASE + 0x54)
/** HRTIM_TIMC_CHPCR Timerx Chopper Register **/
#define HRTIM_TIMC_CHPCR			MMIO32(HRTIM_TIMC_BASE + 0x58)
/** HRTIM_TIMC_CPT1CCR Timerx Capture 2 Control Register **/
#define HRTIM_TIMC_CPT1CCR			MMIO32(HRTIM_TIMC_BASE + 0x5c)
/** HRTIM_TIMC_CPT2CCR CPT2xCR **/
#define HRTIM_TIMC_CPT2CCR			MMIO32(HRTIM_TIMC_BASE + 0x60)
/** HRTIM_TIMC_OUTCR Timerx Output Register **/
#define HRTIM_TIMC_OUTCR			MMIO32(HRTIM_TIMC_BASE + 0x64)
/** HRTIM_TIMC_FLTCR Timerx Fault Register **/
#define HRTIM_TIMC_FLTCR			MMIO32(HRTIM_TIMC_BASE + 0x68)

/**@}*/


/** @defgroup hrtim_timc_timccr TIMCCR Timerx Control Register
@{*/


#define HRTIM_TIMC_TIMCCR_UPDGAT_SHIFT		28
#define HRTIM_TIMC_TIMCCR_UPDGAT_MASK		0x0f
/** @defgroup hrtim_timc_timccr_updgat UPDGAT Update Gating
@{*/
/**@}*/

/** HRTIM_TIMC_TIMCCR_PREEN Preload enable **/
#define HRTIM_TIMC_TIMCCR_PREEN		(1 << 27)

#define HRTIM_TIMC_TIMCCR_DACSYNC_SHIFT		25
#define HRTIM_TIMC_TIMCCR_DACSYNC_MASK		0x03
/** @defgroup hrtim_timc_timccr_dacsync DACSYNC AC Synchronization
@{*/
/**@}*/

/** HRTIM_TIMC_TIMCCR_MSTU Master Timer update **/
#define HRTIM_TIMC_TIMCCR_MSTU		(1 << 24)
/** HRTIM_TIMC_TIMCCR_TEU TEU **/
#define HRTIM_TIMC_TIMCCR_TEU		(1 << 23)
/** HRTIM_TIMC_TIMCCR_TDU TDU **/
#define HRTIM_TIMC_TIMCCR_TDU		(1 << 22)
/** HRTIM_TIMC_TIMCCR_TCU TCU **/
#define HRTIM_TIMC_TIMCCR_TCU		(1 << 21)
/** HRTIM_TIMC_TIMCCR_TBU TBU **/
#define HRTIM_TIMC_TIMCCR_TBU		(1 << 20)
/** HRTIM_TIMC_TIMCCR_TxRSTU Timerx reset update **/
#define HRTIM_TIMC_TIMCCR_TxRSTU		(1 << 18)
/** HRTIM_TIMC_TIMCCR_TxREPU Timer x Repetition update **/
#define HRTIM_TIMC_TIMCCR_TxREPU		(1 << 17)

#define HRTIM_TIMC_TIMCCR_DELCMP4_SHIFT		14
#define HRTIM_TIMC_TIMCCR_DELCMP4_MASK		0x03
/** @defgroup hrtim_timc_timccr_delcmp4 DELCMP4 Delayed CMP4 mode
@{*/
/**@}*/


#define HRTIM_TIMC_TIMCCR_DELCMP2_SHIFT		12
#define HRTIM_TIMC_TIMCCR_DELCMP2_MASK		0x03
/** @defgroup hrtim_timc_timccr_delcmp2 DELCMP2 Delayed CMP2 mode
@{*/
/**@}*/

/** HRTIM_TIMC_TIMCCR_SYNCSTRTx Synchronization Starts Timer x **/
#define HRTIM_TIMC_TIMCCR_SYNCSTRTx		(1 << 11)
/** HRTIM_TIMC_TIMCCR_SYNCRSTx Synchronization Resets Timer x **/
#define HRTIM_TIMC_TIMCCR_SYNCRSTx		(1 << 10)
/** HRTIM_TIMC_TIMCCR_PSHPLL Push-Pull mode enable **/
#define HRTIM_TIMC_TIMCCR_PSHPLL		(1 << 6)
/** HRTIM_TIMC_TIMCCR_HALF Half mode enable **/
#define HRTIM_TIMC_TIMCCR_HALF		(1 << 5)
/** HRTIM_TIMC_TIMCCR_RETRIG Re-triggerable mode **/
#define HRTIM_TIMC_TIMCCR_RETRIG		(1 << 4)
/** HRTIM_TIMC_TIMCCR_CONT Continuous mode **/
#define HRTIM_TIMC_TIMCCR_CONT		(1 << 3)

#define HRTIM_TIMC_TIMCCR_CK_PSCx_SHIFT		0
#define HRTIM_TIMC_TIMCCR_CK_PSCx_MASK		0x07
/** @defgroup hrtim_timc_timccr_ck_pscx CKPSCx HRTIM Timer x Clock prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_timcisr TIMCISR Timerx Interrupt Status Register
@{*/

/** HRTIM_TIMC_TIMCISR_O2STAT Output 2 State **/
#define HRTIM_TIMC_TIMCISR_O2STAT		(1 << 19)
/** HRTIM_TIMC_TIMCISR_O1STAT Output 1 State **/
#define HRTIM_TIMC_TIMCISR_O1STAT		(1 << 18)
/** HRTIM_TIMC_TIMCISR_IPPSTAT Idle Push Pull Status **/
#define HRTIM_TIMC_TIMCISR_IPPSTAT		(1 << 17)
/** HRTIM_TIMC_TIMCISR_CPPSTAT Current Push Pull Status **/
#define HRTIM_TIMC_TIMCISR_CPPSTAT		(1 << 16)
/** HRTIM_TIMC_TIMCISR_DLYPRT Delayed Protection Flag **/
#define HRTIM_TIMC_TIMCISR_DLYPRT		(1 << 14)
/** HRTIM_TIMC_TIMCISR_RST Reset Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_RST		(1 << 13)
/** HRTIM_TIMC_TIMCISR_RSTx2 Output 2 Reset Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_RSTx2		(1 << 12)
/** HRTIM_TIMC_TIMCISR_SETx2 Output 2 Set Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_SETx2		(1 << 11)
/** HRTIM_TIMC_TIMCISR_RSTx1 Output 1 Reset Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_RSTx1		(1 << 10)
/** HRTIM_TIMC_TIMCISR_SETx1 Output 1 Set Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_SETx1		(1 << 9)
/** HRTIM_TIMC_TIMCISR_CPT2 Capture2 Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_CPT2		(1 << 8)
/** HRTIM_TIMC_TIMCISR_CPT1 Capture1 Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_CPT1		(1 << 7)
/** HRTIM_TIMC_TIMCISR_UPD Update Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_UPD		(1 << 6)
/** HRTIM_TIMC_TIMCISR_REP Repetition Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_REP		(1 << 4)
/** HRTIM_TIMC_TIMCISR_CMP4 Compare 4 Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_CMP4		(1 << 3)
/** HRTIM_TIMC_TIMCISR_CMP3 Compare 3 Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_CMP3		(1 << 2)
/** HRTIM_TIMC_TIMCISR_CMP2 Compare 2 Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_CMP2		(1 << 1)
/** HRTIM_TIMC_TIMCISR_CMP1 Compare 1 Interrupt Flag **/
#define HRTIM_TIMC_TIMCISR_CMP1		(1 << 0)

/**@}*/

/** @defgroup hrtim_timc_timcicr TIMCICR Timerx Interrupt Clear Register
@{*/

/** HRTIM_TIMC_TIMCICR_DLYPRTC Delayed Protection Flag Clear **/
#define HRTIM_TIMC_TIMCICR_DLYPRTC		(1 << 14)
/** HRTIM_TIMC_TIMCICR_RSTC Reset Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_RSTC		(1 << 13)
/** HRTIM_TIMC_TIMCICR_RSTx2C Output 2 Reset flag Clear **/
#define HRTIM_TIMC_TIMCICR_RSTx2C		(1 << 12)
/** HRTIM_TIMC_TIMCICR_SET2xC Output 2 Set flag Clear **/
#define HRTIM_TIMC_TIMCICR_SET2xC		(1 << 11)
/** HRTIM_TIMC_TIMCICR_RSTx1C Output 1 Reset flag Clear **/
#define HRTIM_TIMC_TIMCICR_RSTx1C		(1 << 10)
/** HRTIM_TIMC_TIMCICR_SET1xC Output 1 Set flag Clear **/
#define HRTIM_TIMC_TIMCICR_SET1xC		(1 << 9)
/** HRTIM_TIMC_TIMCICR_CPT2C Capture2 Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_CPT2C		(1 << 8)
/** HRTIM_TIMC_TIMCICR_CPT1C Capture1 Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_CPT1C		(1 << 7)
/** HRTIM_TIMC_TIMCICR_UPDC Update Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_UPDC		(1 << 6)
/** HRTIM_TIMC_TIMCICR_REPC Repetition Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_REPC		(1 << 4)
/** HRTIM_TIMC_TIMCICR_CMP4C Compare 4 Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_CMP4C		(1 << 3)
/** HRTIM_TIMC_TIMCICR_CMP3C Compare 3 Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_CMP3C		(1 << 2)
/** HRTIM_TIMC_TIMCICR_CMP2C Compare 2 Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_CMP2C		(1 << 1)
/** HRTIM_TIMC_TIMCICR_CMP1C Compare 1 Interrupt flag Clear **/
#define HRTIM_TIMC_TIMCICR_CMP1C		(1 << 0)

/**@}*/

/** @defgroup hrtim_timc_timcdier5 TIMCDIER5 TIMxDIER5
@{*/

/** HRTIM_TIMC_TIMCDIER5_DLYPRTDE DLYPRTDE **/
#define HRTIM_TIMC_TIMCDIER5_DLYPRTDE		(1 << 30)
/** HRTIM_TIMC_TIMCDIER5_RSTDE RSTDE **/
#define HRTIM_TIMC_TIMCDIER5_RSTDE		(1 << 29)
/** HRTIM_TIMC_TIMCDIER5_RSTx2DE RSTx2DE **/
#define HRTIM_TIMC_TIMCDIER5_RSTx2DE		(1 << 28)
/** HRTIM_TIMC_TIMCDIER5_SETx2DE SETx2DE **/
#define HRTIM_TIMC_TIMCDIER5_SETx2DE		(1 << 27)
/** HRTIM_TIMC_TIMCDIER5_RSTx1DE RSTx1DE **/
#define HRTIM_TIMC_TIMCDIER5_RSTx1DE		(1 << 26)
/** HRTIM_TIMC_TIMCDIER5_SET1xDE SET1xDE **/
#define HRTIM_TIMC_TIMCDIER5_SET1xDE		(1 << 25)
/** HRTIM_TIMC_TIMCDIER5_CPT2DE CPT2DE **/
#define HRTIM_TIMC_TIMCDIER5_CPT2DE		(1 << 24)
/** HRTIM_TIMC_TIMCDIER5_CPT1DE CPT1DE **/
#define HRTIM_TIMC_TIMCDIER5_CPT1DE		(1 << 23)
/** HRTIM_TIMC_TIMCDIER5_UPDDE UPDDE **/
#define HRTIM_TIMC_TIMCDIER5_UPDDE		(1 << 22)
/** HRTIM_TIMC_TIMCDIER5_REPDE REPDE **/
#define HRTIM_TIMC_TIMCDIER5_REPDE		(1 << 20)
/** HRTIM_TIMC_TIMCDIER5_CMP4DE CMP4DE **/
#define HRTIM_TIMC_TIMCDIER5_CMP4DE		(1 << 19)
/** HRTIM_TIMC_TIMCDIER5_CMP3DE CMP3DE **/
#define HRTIM_TIMC_TIMCDIER5_CMP3DE		(1 << 18)
/** HRTIM_TIMC_TIMCDIER5_CMP2DE CMP2DE **/
#define HRTIM_TIMC_TIMCDIER5_CMP2DE		(1 << 17)
/** HRTIM_TIMC_TIMCDIER5_CMP1DE CMP1DE **/
#define HRTIM_TIMC_TIMCDIER5_CMP1DE		(1 << 16)
/** HRTIM_TIMC_TIMCDIER5_DLYPRTIE DLYPRTIE **/
#define HRTIM_TIMC_TIMCDIER5_DLYPRTIE		(1 << 14)
/** HRTIM_TIMC_TIMCDIER5_RSTIE RSTIE **/
#define HRTIM_TIMC_TIMCDIER5_RSTIE		(1 << 13)
/** HRTIM_TIMC_TIMCDIER5_RSTx2IE RSTx2IE **/
#define HRTIM_TIMC_TIMCDIER5_RSTx2IE		(1 << 12)
/** HRTIM_TIMC_TIMCDIER5_SETx2IE SETx2IE **/
#define HRTIM_TIMC_TIMCDIER5_SETx2IE		(1 << 11)
/** HRTIM_TIMC_TIMCDIER5_RSTx1IE RSTx1IE **/
#define HRTIM_TIMC_TIMCDIER5_RSTx1IE		(1 << 10)
/** HRTIM_TIMC_TIMCDIER5_SET1xIE SET1xIE **/
#define HRTIM_TIMC_TIMCDIER5_SET1xIE		(1 << 9)
/** HRTIM_TIMC_TIMCDIER5_CPT2IE CPT2IE **/
#define HRTIM_TIMC_TIMCDIER5_CPT2IE		(1 << 8)
/** HRTIM_TIMC_TIMCDIER5_CPT1IE CPT1IE **/
#define HRTIM_TIMC_TIMCDIER5_CPT1IE		(1 << 7)
/** HRTIM_TIMC_TIMCDIER5_UPDIE UPDIE **/
#define HRTIM_TIMC_TIMCDIER5_UPDIE		(1 << 6)
/** HRTIM_TIMC_TIMCDIER5_REPIE REPIE **/
#define HRTIM_TIMC_TIMCDIER5_REPIE		(1 << 4)
/** HRTIM_TIMC_TIMCDIER5_CMP4IE CMP4IE **/
#define HRTIM_TIMC_TIMCDIER5_CMP4IE		(1 << 3)
/** HRTIM_TIMC_TIMCDIER5_CMP3IE CMP3IE **/
#define HRTIM_TIMC_TIMCDIER5_CMP3IE		(1 << 2)
/** HRTIM_TIMC_TIMCDIER5_CMP2IE CMP2IE **/
#define HRTIM_TIMC_TIMCDIER5_CMP2IE		(1 << 1)
/** HRTIM_TIMC_TIMCDIER5_CMP1IE CMP1IE **/
#define HRTIM_TIMC_TIMCDIER5_CMP1IE		(1 << 0)

/**@}*/

/** @defgroup hrtim_timc_cntcr CNTCR Timerx Counter Register
@{*/


#define HRTIM_TIMC_CNTCR_CNTx_SHIFT		0
#define HRTIM_TIMC_CNTCR_CNTx_MASK		0xffff
/** @defgroup hrtim_timc_cntcr_cntx CNTx Timerx Counter value
@{*/
/**@}*/


/**@}*/

