grevaillot/svd_tools/headers/STM32H7x7_CM7/hrtim_timc.h
/** @defgroup hrtim_timc_cpt2ccr CPT2CCR CPT2xCR
@{*/

/** HRTIM_TIMC_CPT2CCR_TECMP2 Timer E Compare 2 **/
#define HRTIM_TIMC_CPT2CCR_TECMP2		(1 << 31)
/** HRTIM_TIMC_CPT2CCR_TECMP1 Timer E Compare 1 **/
#define HRTIM_TIMC_CPT2CCR_TECMP1		(1 << 30)
/** HRTIM_TIMC_CPT2CCR_TE1RST Timer E output 1 Reset **/
#define HRTIM_TIMC_CPT2CCR_TE1RST		(1 << 29)
/** HRTIM_TIMC_CPT2CCR_TE1SET Timer E output 1 Set **/
#define HRTIM_TIMC_CPT2CCR_TE1SET		(1 << 28)
/** HRTIM_TIMC_CPT2CCR_TDCMP2 Timer D Compare 2 **/
#define HRTIM_TIMC_CPT2CCR_TDCMP2		(1 << 27)
/** HRTIM_TIMC_CPT2CCR_TDCMP1 Timer D Compare 1 **/
#define HRTIM_TIMC_CPT2CCR_TDCMP1		(1 << 26)
/** HRTIM_TIMC_CPT2CCR_TD1RST Timer D output 1 Reset **/
#define HRTIM_TIMC_CPT2CCR_TD1RST		(1 << 25)
/** HRTIM_TIMC_CPT2CCR_TD1SET Timer D output 1 Set **/
#define HRTIM_TIMC_CPT2CCR_TD1SET		(1 << 24)
/** HRTIM_TIMC_CPT2CCR_TBCMP2 Timer B Compare 2 **/
#define HRTIM_TIMC_CPT2CCR_TBCMP2		(1 << 19)
/** HRTIM_TIMC_CPT2CCR_TBCMP1 Timer B Compare 1 **/
#define HRTIM_TIMC_CPT2CCR_TBCMP1		(1 << 18)
/** HRTIM_TIMC_CPT2CCR_TB1RST Timer B output 1 Reset **/
#define HRTIM_TIMC_CPT2CCR_TB1RST		(1 << 17)
/** HRTIM_TIMC_CPT2CCR_TB1SET Timer B output 1 Set **/
#define HRTIM_TIMC_CPT2CCR_TB1SET		(1 << 16)
/** HRTIM_TIMC_CPT2CCR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIMC_CPT2CCR_TACMP2		(1 << 15)
/** HRTIM_TIMC_CPT2CCR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIMC_CPT2CCR_TACMP1		(1 << 14)
/** HRTIM_TIMC_CPT2CCR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIMC_CPT2CCR_TA1RST		(1 << 13)
/** HRTIM_TIMC_CPT2CCR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIMC_CPT2CCR_TA1SET		(1 << 12)
/** HRTIM_TIMC_CPT2CCR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV10CPT		(1 << 11)
/** HRTIM_TIMC_CPT2CCR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV9CPT		(1 << 10)
/** HRTIM_TIMC_CPT2CCR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV8CPT		(1 << 9)
/** HRTIM_TIMC_CPT2CCR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV7CPT		(1 << 8)
/** HRTIM_TIMC_CPT2CCR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV6CPT		(1 << 7)
/** HRTIM_TIMC_CPT2CCR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV5CPT		(1 << 6)
/** HRTIM_TIMC_CPT2CCR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV4CPT		(1 << 5)
/** HRTIM_TIMC_CPT2CCR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV3CPT		(1 << 4)
/** HRTIM_TIMC_CPT2CCR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV2CPT		(1 << 3)
/** HRTIM_TIMC_CPT2CCR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIMC_CPT2CCR_EXEV1CPT		(1 << 2)
/** HRTIM_TIMC_CPT2CCR_UDPCPT Update Capture **/
#define HRTIM_TIMC_CPT2CCR_UDPCPT		(1 << 1)
/** HRTIM_TIMC_CPT2CCR_SWCPT Software Capture **/
#define HRTIM_TIMC_CPT2CCR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timc_outcr OUTCR Timerx Output Register
@{*/

/** HRTIM_TIMC_OUTCR_DIDL2 Output 2 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMC_OUTCR_DIDL2		(1 << 23)
/** HRTIM_TIMC_OUTCR_CHP2 Output 2 Chopper enable **/
#define HRTIM_TIMC_OUTCR_CHP2		(1 << 22)

#define HRTIM_TIMC_OUTCR_FAULT2_SHIFT		20
#define HRTIM_TIMC_OUTCR_FAULT2_MASK		0x03
/** @defgroup hrtim_timc_outcr_fault2 FAULT2 Output 2 Fault state
@{*/
/**@}*/

/** HRTIM_TIMC_OUTCR_IDLES2 Output 2 Idle State **/
#define HRTIM_TIMC_OUTCR_IDLES2		(1 << 19)
/** HRTIM_TIMC_OUTCR_IDLEM2 Output 2 Idle mode **/
#define HRTIM_TIMC_OUTCR_IDLEM2		(1 << 18)
/** HRTIM_TIMC_OUTCR_POL2 Output 2 polarity **/
#define HRTIM_TIMC_OUTCR_POL2		(1 << 17)

#define HRTIM_TIMC_OUTCR_DLYPRT_SHIFT		10
#define HRTIM_TIMC_OUTCR_DLYPRT_MASK		0x07
/** @defgroup hrtim_timc_outcr_dlyprt DLYPRT Delayed Protection
@{*/
/**@}*/

/** HRTIM_TIMC_OUTCR_DLYPRTEN Delayed Protection Enable **/
#define HRTIM_TIMC_OUTCR_DLYPRTEN		(1 << 9)
/** HRTIM_TIMC_OUTCR_DTEN Deadtime enable **/
#define HRTIM_TIMC_OUTCR_DTEN		(1 << 8)
/** HRTIM_TIMC_OUTCR_DIDL1 Output 1 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMC_OUTCR_DIDL1		(1 << 7)
/** HRTIM_TIMC_OUTCR_CHP1 Output 1 Chopper enable **/
#define HRTIM_TIMC_OUTCR_CHP1		(1 << 6)

#define HRTIM_TIMC_OUTCR_FAULT1_SHIFT		4
#define HRTIM_TIMC_OUTCR_FAULT1_MASK		0x03
/** @defgroup hrtim_timc_outcr_fault1 FAULT1 Output 1 Fault state
@{*/
/**@}*/

/** HRTIM_TIMC_OUTCR_IDLES1 Output 1 Idle State **/
#define HRTIM_TIMC_OUTCR_IDLES1		(1 << 3)
/** HRTIM_TIMC_OUTCR_IDLEM1 Output 1 Idle mode **/
#define HRTIM_TIMC_OUTCR_IDLEM1		(1 << 2)
/** HRTIM_TIMC_OUTCR_POL1 Output 1 polarity **/
#define HRTIM_TIMC_OUTCR_POL1		(1 << 1)

/**@}*/

/** @defgroup hrtim_timc_fltcr FLTCR Timerx Fault Register
@{*/

/** HRTIM_TIMC_FLTCR_FLTLCK Fault sources Lock **/
#define HRTIM_TIMC_FLTCR_FLTLCK		(1 << 31)
/** HRTIM_TIMC_FLTCR_FLT5EN Fault 5 enable **/
#define HRTIM_TIMC_FLTCR_FLT5EN		(1 << 4)
/** HRTIM_TIMC_FLTCR_FLT4EN Fault 4 enable **/
#define HRTIM_TIMC_FLTCR_FLT4EN		(1 << 3)
/** HRTIM_TIMC_FLTCR_FLT3EN Fault 3 enable **/
#define HRTIM_TIMC_FLTCR_FLT3EN		(1 << 2)
/** HRTIM_TIMC_FLTCR_FLT2EN Fault 2 enable **/
#define HRTIM_TIMC_FLTCR_FLT2EN		(1 << 1)
/** HRTIM_TIMC_FLTCR_FLT1EN Fault 1 enable **/
#define HRTIM_TIMC_FLTCR_FLT1EN		(1 << 0)

/**@}*/
